#integer ფუნქცია ჩვენ გვჭირდება იმისთვის, რომ გამოვსახოთ მთელი რიცხვები როგორიცაა: 5 10 20 
num1 =int(input("enter number: "))
num2 =int(input("enter number: "))
num3 =int(input("enter number: "))
num4 =int(input("enter number: "))
num5 =int(input("enter number: "))
print((num1 + num2 + num3 + num4 + num5)/5)



#print("") - ეს ფუნქცია ჩვენ გვეხმარება რომ გამოვსახოთ ჩვენი დაწერილი კოდი
#string"" - რომელიც გამოსახავს ტექსტურ მონაცემტა ტიპს
#integer - რიცხვთა მონაცემთა ტიპი, რომელიც ნიშნავს ათწილად რიცხვს
#დეკლარაცია ანუ ცვლადის შექმნა
#snake_case ამას ჩვენ გამოვიყენებთ მრავალ სიტყვიან ცვლადებში ქვედა ტირეთი "_" რომელსაც ვიყენებთ space-ს ნაცვლად
#type ფუნქცია რომელიც გამოგვისახავსმის ბრჩხილებში გადაცემულ მონაცემთა ტიპს