#argument არის მნიშვნელობა, რომელსაც ვაწვდით ფუნქციას მისი გამოძახებისას
#range ფუნქცია არის რაიმე რიცხვების მიმდევრობა მაგალითად for i in rage(5) ასე დაბეჭდავს 5 რაიმეს რასაც ჩვენ გადავცემთ
total = sum(range(50, 101))
print("ჯამი:", total)


ნამრავლი=0
for i in range(100, 200):
    ნამრავლი=i 

print("ნამრავლი= ", ნამრავლი)


# for ციკლი გამოიყენება მაშინ როცა ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
# while ციკლი გამოიყენება მაშინ, როცა არ ვიცით რამდენჯერ შესრულდება ციკლი,

i = 1
while i <= 10:
    print(i)
    i += 1

password = "2007"
user_input =input("შეიყვანეთ პაროლი: ")


while password != user_input:
    print("wrong password")
    user_input =input("შეიყვანეთ პაროლი: ")

print ("you win")
