#Data conversion არის მონაცემთა კონვერსია ეს გვეხმარება იმაში, რომ მონაცემი გარდავქმნათ სხვა რაიმე მეორე ტიპად.
# მაგალითად ჩვენ შექგვიძლია რომ ტექსტური string, რომ გარდავქმნათ ჩვეულებრივ integer-ად.
# ეს მაშინარის საჭირო თუ სხვადასხვა ტიპის მონაცემთან გვიწევს მუშაობა და ესგვინდა რომ ჩვენ გავაერთიანოთ 
# მაგალითდ age=20    ეს არის string ტიპის მონაცემი
# და ამის გადაქცევა ჩვენ შეგვიძლია ასე age_number = int(age) აქ ჩვენ გადაგვყავს string-ი integer-ად
 
  
#int() - გადააქცევს მნიშვნელობას მთელ რიცხვათ და მთლიანად იწერება ასე (integer)
#მაგალითად ასე ჩვენ შექგვიძლია ტექსტიდან მთელ რიცხვში გადაყვანა
num1= int("25")      # anu num1 = 25
#ათწილადიდან მთელ რიცხვში გადასაყვანად ეს გვჭირდება
num2= int(4.6)       # აქ გამოგვიტანს num2 = 4



#str() - გადააქცევს მნიშვნელობას ტექსტად და იწერება ასე (string)
#მთელი რიცხვიდან ტექსტში
bla = str(123)      #bla = "123"
# ათწილადი რიცხვიდან ტექსტში თუ გვინდა მაშინ 
bla2 = str(3.14)    # bla2 = "3.14"



#float() - გადააქცევს მნიშვნელობას ათწილადად ანუ 10.5
#ტექსტიდან თგვინდა ათწილადში გადაყვანა მაშინ
blabla = float("7.5")  # m = 7.5

# მთელი რიცხვიდან ათწილადი 
blabla2 = float(10)    #blabla2 = 10.0 











