# ალგორითმი არის რაიმე ნაბიჯების მიხედვით დალაგებული ტიპი თუ როგორ უნდა შესრულდეს რაიმე მასალა მაგალითად როდესაც რამეს აკეთებ და დაყობ ნაწილებათ თანმიმდევრობის მიხედვით
# Sequencing- არის რაიმეს რიგის შესრულება იმ თანმიმდევრობით როგორც წერია
# Iteration-რაიმე მოძრაობის გამეორება იქამდე სანამ არშესრულდება ის 
# Selection- რაიმე გადაწყვეტილების მიღება პირობების მიხედვით  რა უნდა გაკეთდეს მაგალითად ერთ შემთხვევაში ან კიდე რა მეორეში



# Flowchart - რაიმე დიაგრამა, რომელიც აჩვენებს როგორ მიმდინარეობს ალგორითმი ნაბიჯნაბიჯ

# Pseudo code  - აღწერს მაგალითად რაიმე კოდის ლოგიკას ტექსტის სახით 


# Natural Language- ჩვეულებრივი ენით აღწერილი ინსტრუქციები მაგალითად როდესაც ვუყვებით ადამიანს თუ რა გააკეთოს





number = int(input("შეიყვანე რიცხვი: "))

number / 2==2

print(True or False)

